/// 存储相关常量

///Byte与Byte的倍数
const BYTE = 1;

///KB与Byte的倍数
const KB = 1024;

///MB与Byte的倍数
const MB = 1048576;

///GB与Byte的倍数
const GB = 1073741824;

/// 时间相关常量

///毫秒与毫秒的倍数
const MSEC = 1;

///秒与毫秒的倍数
const SEC = 1000;

///分与毫秒的倍数
const MIN = 60000;

///时与毫秒的倍数

const HOUR = 3600000;

///天与毫秒的倍数
const DAY = 86400000;

/// 正则相关常量

///正则：手机号（简单）
const REGEX_MOBILE_SIMPLE = r'^[1]\d{10}$';

///正则：手机号（精确）*
///移动：134(0-8)、135、136、137、138、139、147、150、151、152、157、158、159、178、182、183、184、187、188
///联通：130、131、132、145、155、156、175、176、185、186
///电信：133、153、173、177、180、181、189
///全球星：1349
///虚拟运营商：170

const REGEX_MOBILE_EXACT =
    r'^((13[0-9])|(14[5,7])|(15[0-3,5-8])|(17[0,3,5-8])|(18[0-9])|(147))\d{8}$';

///正则：电话号码
const REGEX_TEL = r'^0\d{2,3}[- ]?\d{7,8}';

///正则：身份证号码15位
const REGEX_IDCARD15 =
    r'^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$';

///正则：身份证号码18位
const REGEX_IDCARD18 =
    r'^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9Xx])$';

///正则：邮箱
const REGEX_EMAIL = r'^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$';

///正则：URL
const REGEX_URL = r'http(s)?://([\w-]+\.)+[\w-]+(/[,\w-./?%&=]*)?';

///正则：汉字
const REGEX_CHZ = r'^[\u4e00-\u9fa5]+$';

///正则：用户名，取值范围为a-z,A-Z,0-9,r'_r',汉字，不能以r'_r'结尾,用户名必须是6-20位
const REGEX_USERNAME = r'^[\w\u4e00-\u9fa5]{6,20}(?<!_)$';

///正则：yyyy-MM-dd格式的日期校验，已考虑平闰年
const REGEX_DATE =
    r'^(?:(?!0000)[0-9]{4}-(?:(?:0[1-9]|1[0-2])-(?:0[1-9]|1[0-9]|2[0-8])|(?:0[13-9]|1[0-2])-(?:29|30)|(?:0[13578]|1[02])-31)|(?:[0-9]{2}(?:0[48]|[2468][048]|[13579][26])|(?:0[48]|[2468][048]|[13579][26])00)-02-29)$';

///正则：IP地址
const REGEX_IP =
    r'((2[0-4]\d|25[0-5]|[01]?\d\d?)\.){3}(2[0-4]\d|25[0-5]|[01]?\d\d?)';

///正则：密码
const PASSWORD = r'([\s\S]){6,18}$';
